{"pageProps":{"postData":{"id":"software-engineering-for-parents","content":"Is your son or daughter a software engineer and you have no idea what they do?\r\nAnd every time you ask, they start speaking in what sounds like a foreign language?\r\nThen this article is for you!\r\n\r\nLet's start by defining what an engineer does.\r\nEngineers solve problems by designing, building, and maintaining things.\r\nDesigning is the process of planning how you are going to solve a problem.\r\nBuilding is the process of actually making the thing that solves the problem.\r\nAnd maintaining is the process of making sure the thing you built continues to solve the problem. \r\n\r\nOne of the oldest types of engineers is called a \"civil engineer\", they are the engineers that help make roads, buildings, railways, sewer systems, and just about everything else that society uses to function.\r\nSuppose a civil engineer is tasked with solving the problem of getting people from one island to another.\r\nTo solve this problem, the civil engineer builds a bridge.\r\nBut before they build the bridge, they need to design it.\r\nIs the bridge a pedestrian bridge or a road bridge?\r\nIf it's a road bridge, how many lanes should it have?\r\nIn the design phase, the civil engineer defines *what* they need to build and *how* they are going to build it.\r\nOnce the design is complete, the civil engineer works with various contractors to build the bridge.\r\nBut the work is not done when the bridge is complete, the civil engineer needs to ensure that the bridge continues to be safe for long after its built.\r\nThey do this by performing regular safety checks on the bridge, repairing it if any issues arise.\r\nThis process is known as maintenance.\r\n\r\nTraditional engineers, like the civil engineer mentioned above, design, build, and maintain things that exist in the physical world.\r\nYou can see, touch, and feel the things these engineers build.\r\nSoftware engineers, on the other hand, write code, which does not exist in the physical world.\r\nThe code written by software engineers is like the words written by a novelist.\r\nWords themselves are useless.\r\nIt's not until a human \"reads\" these words and interprets their meaning, that value is extracted.\r\nThis value could be entertainment if the words tell a story, or informational if the words teach the reader something new.\r\nSimilarly, code is \"read\" by computers, who interpret it as a sequence of instructions.\r\nThese instructions tell the computer how to do something.\r\nThe value of code is created when we use it to tell a computer how to solve a problem. \r\nSoftware engineering is the discipline of instructing computers to solve problems.\r\n\r\nCode is a language that computers can understand.\r\nSoftware engineers write code into files on a computer using a text-editor, think \"Microsoft word for code\".\r\nThe files containing the code are like the pages of a book.\r\nA collection of these files is called a codebase.\r\nA codebase is like a book that tells a computer how to solve a problem.\r\nFor example, part of the WhatsApp codebase instructs your phone on how to send and receive text messages.\r\nSoftware engineers are essentially collaborative authors of books that tell computers how to solve problems.\r\nThe term \"software\" refers to everything involved in telling a computer how to solve a problem.\r\n\r\nSoftware engineers design, build, and maintain software.\r\nSoftware design is done by writing design documents.\r\nDesign documents answer the \"why\", \"how\", and \"what\" of the problem you are solving.\r\nThe why defines the problem and why it matters, the how defines the requirements of a solution, and the what is the plan for building the solution.\r\n\r\nSoftware is built by writing code.\r\nThe process of writing code is called \"programming\", and makes up a large portion of a software engineer's job.\r\nAn even larger portion however, is spent *reading* code.\r\nThis is because most software engineers work on large codebases written by a bunch of other software engineers.\r\nAnd oftentimes, the original authors of the codebase no longer work at the same company.\r\nTo make changes to the codebase, software engineers need to understand it, or at least the part that they are changing. \r\nThis is why they spend so much time reading code that others have written.\r\nSoftware engineers also read the new code of their peers, in a process called \"code review\". \r\nDuring this process, the engineer ensures the code they are reviewing does what it's supposed to do and is easy to understand.\r\nThey often give feedback to the author of the code on how it could be improved.\r\nThis process is similar to having someone proof-read your writing and provide feedback.\r\nGood code is similar to good writing, it's clear, concise, and easy to understand. \r\n\r\nThe work does not end after the code is written.\r\nSoftware engineers must constantly update their code to keep up with the requests of their users.\r\nFor example, if a new emoji is released, the WhatsApp engineers need to update their code to include that new emoji.\r\nThis is the biggest difference between software and traditional branches of engineering.\r\nA bridge may last for over 100 years, software on the other-hand can become outdated in months.\r\nJust think of the difference between your first cell-phone and the phone you have now.\r\nYour first cell-phone had 3 major features:\r\n1. Make phone calls\r\n2. Send text messages \r\n3. And take crappy photos\r\n\r\nYour phone today has Netflix, Facetime, Google Maps, Uber, the list goes on...\r\nAll of this change has happened in a very short amount of time and requires software engineers like your son or daughter to constantly write and rewrite code, even after the original problem is solved.\r\n\r\nSo what does the day-to-day of a software engineer look like?\r\nSoftware engineers generally work in teams of 5-8 people.\r\nThey start their day by having a quick meeting with their teammates called a \"standup\", in which every member of the team shares what they did the day before, what they are currently doing, and if they need help with anything.\r\nAfter their stand-up meeting, they spend the rest of their day working on the tasks assigned to them.\r\nSoftware engineers work in 1-2 week intervals called \"sprints\" in which they get as many tasks done as possible.\r\nAt the end of the sprint, the list of tasks for the entire team is reprioritized, and each member of the team is assigned new tasks for the next sprint.\r\nThis process is repeated over and over again.\r\n\r\nAnd that's about it. If you take away only one thing from this article, let it be this: \"Software engineers tell computers how to solve problems.\"\r\nIf you're still lost, you can at least pretend to know what your child does by saying one of the following to them:\r\n* How's your sprint going?\r\n* Do much code review today?\r\n* I hope your code is cleaner than your room.\r\n","title":"Software Engineering for Parents","description":"An explanation of software engineering for Parents.","date":"2021-03-13"}},"__N_SSG":true}