{"pageProps":{"postData":{"id":"resonance-of-thought","content":"\r\nWhen I was in Grade 9 my science teacher demonstrated the phenomenon of resonance to the class. He held up 2 metal rods and struck one against his desk. The impacted rod began to vibrate and emit a low humming noise. He then held the vibrating rod near the stationary rod, and to the class’ surprise, that rod also began to vibrate and hum. It was as if the force of the vibrating rod magically jumped through the air into the stationary one. But this wasn’t magic, it was resonance: a phenomenon in which a force acting upon an object is amplified if that force matches the object’s natural frequency. All objects have a natural frequency at which they vibrate when disturbed. And when the disturbance itself matches the object’s natural frequency, the resulting vibration is strengthened. The sound waves emitted by the vibrating rod were so similar to the stationary rod’s that they made it vibrate from afar. They resonated with it. Resonance is not exclusive to the physical world. It also applies to thought, and by extension, writing.\r\n\r\nThe natural frequency of a person is the aggregation of their beliefs and values as shaped by their life experience. The typical entrepreneur, for example, believes in the free market and values work ethic, perseverance, and discipline. From their lived experience, these are the factors that enabled their prosperity. And as a consequence, they gravitate towards thoughts that reinforce and propagate these beliefs and values. Tales of Elon Musk and the Space X team successfully launching a rocket into orbit while on the verge of bankruptcy after 3 failed attempts might be enough to make the entrepreneur climax. Whereas to someone with the opposite beliefs and values of an entrepreneur, say a sociology professor, these same stories are met with indifference or even resentment. The sociology professor discounts the autonomy of Elon and co in such stories, attributing their successes and failures to environmental factors beyond their control. The professor’s natural frequency may even be so opposed to such stories that they scowl at the achievements and diminish their utility with a statement along the lines of “With all the money Elon has spent on SpaceX he could’ve solved world hunger”.\r\n\r\nWhenever you find yourself experiencing a pronounced positive reaction to someone else’s words or writing, you’re experiencing resonance of thought. Their ideas go along with the rhythm of your natural frequency. Their articulating beliefs and values you already hold in a new and insightful way or they're telling a story where you’re the main character. Conversely, a reaction of resentment to someone’s thoughts is the result of those thoughts going against the grain of your natural frequency (Ex. the sociology professor resenting the success of Elon Musk in the free market, a system he or she views an inherently oppressive). The cause of the resonance between the two metal rods in my grade 9 science class was physical, whereas the cause of thought resonance is psychological.\r\n\r\nNobel-prize-winning psychologist Daniel Kahneman describes the human brain as an energy conservation machine, constantly pursuing the path of least resistance. According to Kahneman, our brain’s automatic responses and intuitions are evidence of this. Through repetition, our minds learn to recognize and react to specific patterns. This recognition and reaction is then encoded into our subconscious, offloading cognitive effort from the analytical, thinking mind (what Kahneman calls System 2) to the automatic, intuitive mind (what Kahneman calls System 1). System 1 is the mechanism that tells you to lock the door when you leave the house. You don’t need to think about how you’re going to lock the door, you just do it, often without remembering. System 2 evoke is that what thinking confuse into mind that. The previous sentence just activated your system 2. The incoherent grammar went against your expectations, causing your analytical mind (system 2) to take the wheel. Your system 1 is in control when you experience familiar thoughts and situations and your system 2 is invoked when you encounter the unexpected.\r\n\r\nSystem 1 is associated with the mental state of cognitive ease. Repetition strengthens the neural pathways associated with an activity or thought, which over time makes that activity or thought easier to perform and comprehend. As it becomes easier to perform and comprehend, our brains expend less energy, and this reduction of effort is perceived as pleasure. When you’re in a state of cognitive ease you feel a sense of familiarity, truth, goodness, and effortlessness. System 2 is associated with the opposite state: cognitive strain. Unfamiliar situations and a lack of clarity mobilize your system 2, forcing you to think more analytically and heightening your suspicion. The vigilance induced by cognitive strain makes you more likely to identify errors in the thoughts being conveyed. This contrasts heavily with cognitive ease, where your familiarity with the ideas being conveyed makes you pleasantly consume them without questioning their validity. The implications of the stark contrast between system 1 and system 2, cognitive ease and cognitive strain, and resonance of thought and resentment of thought, is what enables the existence of polarized groups with completely different perspectives.\r\n\r\nTo the entrepreneur, capitalism’s emphasis on self-interest, competition, and productivity, results in an innovative and prosperous society. Whereas to the sociology professor, capitalism is a discompassionate system that breeds economic disparity and exploits the common man. In the mind of the entrepreneur, billionaires are morally virtuous agents who have been rewarded for their economic contributions to society. To the sociology professor, billionaires are the epitome of human greed. Both the entrepreneur and the sociology professor are shocked by which thoughts resonate with one another. Rarely does either group stop to consider that since their experiences of the world are completely different, so too are their beliefs and values, and thus their perceptions.\r\n\r\nWhen trying to achieve resonance of thought, System 1 and cognitive ease should be top of mind. Your ultimate goal is to accurately convey your thoughts while expending as little of the audience’s cognitive energy as possible. Simple sentences induce a state of cognitive ease in your audience, making them feel more trustworthy and receptive to what you have to say. Leverage the power of storytelling to prime the idea you’re trying to convey in the reader’s mind. Massage their System 1 with clear logical arguments and examples. And avoid complex sentences to keep their system 2 at bay. That being said, any message that resonates with one reader is bound to breed resentment from another. So don’t be shocked if people are upset at your thoughts, outrage is a compliment. So long as some people hate what you have to say, there will be others who love it.\r\n\r\nWhen trying to uncover the truth, system 2 and cognitive strain are essential. Ask yourself why certain thoughts are so revolting? Are you really a special butterfly that sees the obvious? Or does the purveyor of these grotesque ideas know something you don’t? Acknowledge that you’re biologically wired to disregard opposing views in order to conserve energy. Don’t take the easy way out that is slapping a label on your adversary to discredit them. Put yourself in their shoes, consider the experiences that lead to their beliefs and values. Sometimes the other side is right. But if you never activate your system 2 and think critically about their perspective and how they came to form it, you’ll never know. Truth is rarely found in echo chambers.\r\n","title":"Resonance of Thought","description":"Why some ideas are attractive while others are revolting.","date":"2022-03-03","image":"https://raw.githubusercontent.com/Chris-Behan/chris-behan.github.io/master/public/images/resonance.jpg"}},"__N_SSG":true}