{"pageProps":{"postData":{"id":"dont-help-your-kids-with-their-homework","content":"Helping your kids with their homework is one of the worst things you can do as a parent.\nYou might think that you're helping them, but in reality, you're depriving them of an opportunity to learn, and helping them develop a habit of reliance.\n\nMost parents help their kids with their homework because they want them to do well, they don't want them to get upset, or a combination of both.\nUnfortunately, this completely misses the point of education, which is to *learn*.\nAnd an essential ingredient of learning is feedback, often received in the form of grades.\nWhen a parent helps their kid with their homework, or even worse, does it for them, they deprive them of the opportunity to learn from their mistakes.\nInstead, the kid receives feedback for their parent's work, which isn't all that helpful, especially if they want to improve.\n\"But little Jimmy gets so upset when he gets bad grades!\" the parent may say.\nThat's because little Jimmy believes that the only thing that matters is the letter on his report card and not his actual knowledge of the material.\nAnd the parent reinforces this belief in little Jimmy every time they help him with his homework.\nIf little Jimmy knew the purpose of education was learning itself, he would not get upset about bad grades, he would be excited, as they present an opportunity for learning from his mistakes and actually improving.\nBut instead, the parent helps little Jimmy with his homework instead of letting him figure it out on his own, subconsciously signaling to Jimmy that it's not about whether he learns the material or not, but the *grade* he receives.\nThe selfish parent who cannot bear the short-term burden of a distressed little Jimmy must come to the rescue, relieving him of his intellectual duties by spoon-feeding him the right answers to his homework.\nThese parents are shortsighted.\nBy helping their kids with their homework, they are trading short-term discomfort for a life-long learning impairment.\n\n\nI was lucky enough to grow up with a single Mom, who was far too busy working and minding the house to ever help me with my homework.\nI had no choice but to *learn*.\nYes, there were times when I got bad grades or didn't finish assignments, and yes, these moments made me upset.\nBut did I go crying to my Mom asking her to do my homework for me next time?\nNo, instead I *learned* from these experiences.\nI learned self-discipline, time management, how to ask questions, and general problem-solving skills.\nThese are timeless skills that have served me very well in life.\nTimeless skills, that are unlikely to be possessed by children whose parents help them with their homework.\nI know this because I worked as a tutor throughout high school and university. \nA common trait of almost all the kids I tutored was an intellectual laziness, which manifested as an unwillingness to find answers for themselves.\nOften times my job would consist of just reading their textbooks to them, feeding them the information in a digestible manner.\nThey had no doubt acquired this intellectual laziness through the lifelong habit of their parents helping them with their homework. \nMy employment was a result of the child's schoolwork finally surpassing what the parents themselves were capable of doing.\n\nI'm not suggesting parents completely neglect their children when they struggle with school.\nI'm suggesting that instead of helping their kids with their homework, they\n1. Encourage their child to figure it out on their own, and reinforce their ability to do so.\n2. Recommend resources for learning, like Google.\n3. Emphasize that the purpose of school is to *learn* and that failure and struggle are *required* steps in the learning process.\n\nIt's never too late to stop helping your kids with their homework.\nThey'll thank you for it in the long term.\nRip off the band-aid, let them get bad grades, let them fail, let them **learn**.","title":"Don't help your kids with their homework","description":"Why helping your kids with their homework.","date":"2021-04-18"}},"__N_SSG":true}