{"pageProps":{"postData":{"id":"CanMachinesThink","content":"Consider the following scenario:\r\n\r\nYou're seated at a poker table in Las Vegas. There are two other players at the table. One of the players is wearing sunglasses and a cowboy hat. \"Sunglasses inside?\" You ask internally. Strange, but not as strange as the player to his left. This player is a robot, with a monitor where his head should be. After suppressing your initial surprise, you shift your focus to the game, [5-card draw](https://en.wikipedia.org/wiki/Five-card_draw). You pick up your freshly dealt hand off the beer-stained velvet. 10 of Clubs, Queen of Hearts, 9 of Diamonds, King of Spades, Jack of Clubs. You rearrange them in descending order: King, Queen, Jack, 10, 9; a straight, booyah.\r\n\r\nLet's pause for a moment. How did you rearrange the cards in your hand? Would you say that you had to *think* to do this? You probably started out by placing the King at the leftmost position in your hand. You then placed the Queen to the right of the King, then the Jack to the right of the Queen, and voila, your hand was sorted.\r\n\r\n1. 10, Q, 9, K, J\r\n2. K, 10, Q, 9, J\r\n3. K, Q, 10, 9 J\r\n4. K, Q, J, 10, 9\r\n\r\nYou performed a sorting algorithm without even realizing it. We can even describe this algorithm in just 7 lines of python code:\r\n\r\n```python\r\ndef sort_hand(hand):\r\n    sorted_hand = []\r\n    while hand:\r\n        largest = max(hand)\r\n        sorted_hand.append(largest)\r\n        hand.remove(largest)\r\n    return sorted_hand\r\n```\r\n\r\nIn fact, this is the exact code that the robot player executed to sort the cards in his hand. With that in mind, I ask you, *Can Machines Think?*\r\n\r\nTo avoid an endless argument over the semantics of the question, let's define thinking as\r\n\r\n> \"Everything the conscious human mind does.\"\r\n\r\nThis includes mental arithmetic, remembering, connecting ideas, and any other task that takes up conscious cognitive capacity. \r\n\r\nAdditionally, let's use *[Computers](https://en.wikipedia.org/wiki/Computer)* as our sample machine. \r\n\r\n![https://upload.wikimedia.org/wikipedia/commons/e/e5/Von_Neumann_Architecture.svg](https://upload.wikimedia.org/wikipedia/commons/e/e5/Von_Neumann_Architecture.svg)\r\n\r\nSorting your hand required conscious cognitive effort; you did not just randomly shuffle the cards into descending order. According to our definition, you had to *think*. We were also able to show, with 7 lines of python code, that a computer can do a *subset* of what the conscious human mind does; namely sorting. It seems reasonable then, to conclude that machines can *think* to a *degree*, even if that degree is substantially less than that of a conscious human mind. \r\n\r\nYou may refute this argument, claiming that although the outcome in both situations is the same; a sorted hand, you reasoned about the sorting in some sort of *creative* way that only the human mind is capable of doing. I often hear this argument from my friends who are defensive about having their cognitive abilities compared to a computer. When I ask these friends to elaborate on this *creative* process they usually give me an explanation of *learning,* but that does not apply in the scenario of sorting a deck of cards, which if you are reading this post, you likely already know how to do. Both you and your computer adversary followed a procedure, searching for the largest card in your hand, storing it in memory, placing it at the appropriate position, then repeating this process with the next largest card. The real difference between you and the computer is:\r\n\r\n1. You lack the focus of the computer. You did not just blindly execute the sorting procedure. Instead, as you sorted the cards, your mind wandered, connecting the experience to similar situations you've encountered in the past, visualizing your favorite TikTok, and thinking about what show you're going to watch on Netflix tonight.\r\n2. The program executed on the computer is static, it does not change, whereas the program of our human brain is constantly being modified. Each thought, action, and experience we have modifies our \"program\". Perform an addition in your head, you just strengthened the neural pathways associated with addition, sort a deck of cards, and you just strengthened the neural pathways associated with sorting. This phenomenon is known as [Neuroplasticity](https://en.wikipedia.org/wiki/Neuroplasticity#:~:text=Neuroplasticity%2C%20also%20known%20as%20neural,systematic%20adjustments%20like%20cortical%20remapping.).\r\n3. Your hardware is unique. Since our brain's program has been constantly re-writing itself since birth, no two humans can have the exact same program running.\r\n\r\nIt is nonsensical to dismiss the sorting performed by the computer as less than thinking just because the means to perform the sort differed from that of a human. Can a plane not fly because *how* it attains lift is different from a bird?","title":"Can Machines Think?","description":"Ruminations on a peculiar question.","date":"2021-02-07"}},"__N_SSG":true}