{"pageProps":{"postData":{"id":"forgetting-why-you-build","content":"\r\nPablo was a programmer.\r\nOr at least that's what he told people when they asked \"What do you do for a living?\"\r\nMost people would simply respond with \"Oh cool!\" or \"My nephew wants to be a programmer!\"\r\nBut every once and a while he'd get a deeper response.\r\n\"What does a programmer do?\"\r\nPablo would pause, thoughtfully consider the technicality of his question asker, then respond.\r\n\"I tell computers how to solve problems by writing 'code', which is essentially a language that computers can understand.\"\r\nAt last, his prodding questioner would accept his response and say \"Oh cool!\" or \"My nephew wants to do something like that!\"\r\nBut Pablo's response was dishonest.\r\nThat's not what he does.\r\nThat might be what he wished he did, or what he would expect a programmer to do, or what the programmers in a recent biography that he read, \"Coders at work\", did.\r\nBut Pablo's day-to-day looked nothing like that.\r\n\r\nHis title was \"Software engineer\", even though he actually had a degree in Computer Science.\r\nHe worked for a Big Company with a ton of different products, all of which were household names.\r\nHis Mom would brag to all her friends about her son, Pablo, who worked at {Big Company}, subtly implying that their products were somehow the result of Pablo's \"programming\".\r\nEven Pablo himself would get lost in the fantasy from time to time.\r\nIntroducing himself as \"Pablo, a software engineer at {Big Company}\".\r\nFantasizing about the positive perceptions his newfound acquaintance must have of him.\r\nWhy else would he feel the need to identify with his employer?\r\n\r\nBut deep down, Pablo couldn't help but feel that the whole thing was fake.\r\nThat he didn't actually deserve the giant salary he was getting paid.\r\nThat he didn't actually build _anything_.\r\nThat he was just a cog in a rusty, old, molasses-filled machine, that somehow managed to print money like the federal reserve.\r\nBut he didn't like to think about these things, so whenever such thoughts entered his mind, he'd reassure himself of his merit and value.\r\nHis interview for {Big Company} was very difficult, he'd solved hundreds of leet code questions in preparation and read every chapter of \"Cracking the coding interview\".\r\nHe'd spent countless evenings on side projects to pad his resume and fill his Github.\r\nHe was a smart, hard-working guy, he told himself.\r\n\r\nPablo's first experience with programming was magical.\r\nIt was in his high-school computer science class.\r\nUp until that point, he'd never given much thought as to how computers actually worked.\r\nHow images were drawn to the screen, how messages were sent, or how files were saved.\r\nIn the first class, the students were shown how to write javascript code that would print shapes to the screen.\r\nAnd the first shape Pablo drew was a red square.\r\nHe recalls feeling a sense of wonder and empowerment when reflecting on that first red square.\r\nFrom just a few keystrokes, he was able to create something out of nothing.\r\nBy the end of the week, he had his red square moving from left to right across the screen and teleporting back to its starting position when it reached the end.\r\nBy the end of the semester, he'd built a full-blown 2d-game.\r\nThe player controlled a spaceship equipped with rockets that could blow up enemy spaceships.\r\nThere was a scoreboard, exploding animations, and even special extra-strength enemies that appeared at random intervals.\r\nHe'd decided then and there that he was going to become a programmer.\r\n\r\nFast forward three years of high school, four years of college, and five years of working full-time.\r\nPablo was starting to realize that he wasn't really a programmer or a \"Software engineer\".\r\nEspecially if the definition of either of those terms is someone who \"...instructs computers to solve problems by writing 'code'.\"\r\nSomewhere between that first red square and five years of working at {Big Company}, Pablo had completely lost sight of why he was writing code in the first place.\r\nPablo no longer wrote code to solve problems or build things.\r\nHe wrote code for the sake of writing code.\r\nHe was obsessed with the process.\r\nThe outcome was an unimportant side effect, one that he was too disconnected from to see.\r\nHe'd heard tales from designers and customer support about the product he produced, and how it sometimes wasn't quite right or didn't do what they expected.\r\nBut what did they know.\r\nThe code was clean, and that's what mattered.\r\n\r\nReminiscing about his earlier self, before landing a job at {Big Company}, he didn't care about writing clean code.\r\nHe didn't know about modularity, or readability, or unit tests.\r\nHe'd never even heard of code reviews.\r\nAll he cared about was building things.\r\nWhat a fool he was.\r\n\r\nNow he doesn't build anything.\r\nOr if he did, he's too many layers removed to know what.\r\nInstead, he reads and writes code.\r\nHe obsesses over technology trends and \"best practices\".\r\nHe duels with his fellow engineers in the intellectual battleground known as the Code Review.\r\nEquipped with a myriad of programming principles he picked up from [Uncle Bob](https://en.wikipedia.org/wiki/Robert_C._Martin) and [Martin Fowler](https://martinfowler.com/), he throws out principles and nit-picks during code reviews as if they were Yugioh cards.\r\n\"YAGNI!\" he comments.\r\n\"DRY!\" he suggests.\r\n\"I counter your default parameter suggestion with the Single Responsibility Principle!\" he responds.\r\n\r\nAnd when he's not debating code quality or attempting to predict future use cases in code reviews, Pablo can be found in meetings.\r\nHe's an expert at going into extreme levels of technical detail, which goes over the heads of non-technical stakeholders, in order to appear smarter than he actually is.\r\nHe relies on his non-technical stakeholders conflating the fact that he knows things that they don't, with him being intelligent.\r\nHis answers to yes or no questions are the length of Shakespearean novellas, making the person who asked the question forget their original inquiry.\r\n\"Pablo, can we add reset password functionality to the website this sprint?\"\r\n\"Well you see, the Kubernetes cluster was just upgraded...and then we discovered Python 2 can't handle Unicode strings properly...But the S3 bucket policy isn't secure...so we re-wrote the service in Go...serverless scales so much better than Kubernetes...cold start times were worse than we expected...Functions should be self-documenting...Have you tried turning it on and off again?\"\r\n\r\nPablo is deep in the forest but he doesn't know it.\r\nHe's rewarded for discussing the patterns on the bark, even though the company is in the business of selling lumber.\r\nBut because the lumber business is booming, they can afford to reward Pablo to theorize about the patterns on the bark.\r\nHe doesn't even notice that his theorizing has no effect on how much lumber they sell or the quality of that lumber.\r\nHe lost sight of the forest around the same time he stopped caring about building things.\r\nAnd now all he sees are trees.\r\n\r\nA weird thing happens in complex domains where there are lots of steps between your inputs and the final product.\r\nYou forget the original purpose of the craft.\r\nYou become incessantly focused on the process, while completely disregarding the outputs.\r\nInstead of being concerned with telling a good story, you obsess over punctuation, grammar, and structure.\r\nInstead of caring about the beauty of the picture you draw, you focus solely on the technique you used.\r\nYou care more about writing clean code with high test coverage than making a product that's delightful to use.\r\nYou forget why you build.\r\n","title":"Forgetting Why You Build","description":"A tale on the tendency of humans to mistake what matters with processes.","date":"2022-10-16","image":"https://raw.githubusercontent.com/Chris-Behan/chris-behan.github.io/master/public/images/fall.jpg"}},"__N_SSG":true}