{"pageProps":{"postData":{"id":"simple-insights","content":"\r\nThere's a set of profound truths hiding in plain sight. They're so simple that once heard, their\r\ntruth is undisputed. Yet it's not until they're heard that we're made aware of their existence.\r\nThey're powerful statements that can be applied to countless scenarios. Simple insights\r\nthat can be wielded like a compass to navigate the complexity of the world. They describe the\r\n\"why\" of things and help you make the right decisions.\r\n\r\nOne such insight is that there are two types of people in life: alive players and dead\r\nplayers. Alive players can do new things, where \"new\" is defined as something they haven't done\r\nin the past. Dead players are incapable of doing new things and repeat the same actions over and\r\nover again. It follows from this simple insight that you can predict the actions of a dead player and you\r\ncannot predict the actions of an alive player. The implications of this truth are infinite. If you\r\ncan identify that you're competing against a dead player incapable of learning, you know that their\r\nset of possible moves is limited to the moves they've performed in the past. The dead player on the\r\nbasketball court drives right every time, allowing you to anticipate and block their drive, every\r\ntime. The alive player on the other hand is unguardable, he might drive left, pull up from 3, or\r\nhit you with a floater. Each week he adds a new move to his repertoire.\r\n\r\nSimple insights are domain agnostic. They contain universal truths whose application is boundless.\r\nThe dead player in business ships the same product each year. The dead player in politics\r\nhas the same platform every election cycle. And over a long enough time span, alive players beat\r\ndead players. In business the alive player reacts to the demands of the market. He's constantly\r\nadapting both his product and process in response to internal and external feedback. The alive\r\npolitician (though rare), adapts his platform to the changing sentiment of his constituents. He\r\nrefutes dogma that states political opinions must be binary and mutually exclusive.\r\n\r\nLike a chain reaction, once one simple insight is discovered, other related insights appear around\r\nit. After thinking deeply about alive and dead players, one might deduce another insight:\r\nTo live is to embrace change and to die is to deny it. This is true in both a physical and\r\nspiritual sense. The infant, full of life, is constantly changing. Each day she's exposed to a new\r\nexperience, constantly learning new words, new tastes, and new feelings. She learns that the word\r\n\"juice\" prompts her parents to give her her favorite drink. She learns which behaviors to avoid,\r\nlike chewing toys, from the yells of her father. She internalizes the feedback from her\r\nenvironment and adapts her behavior accordingly. She lives.\r\nOn the other end of the spectrum, the old closed-minded widow, set in her ways, slowly awaits death.\r\nFor the widow, each passing day is indistinguishable from the previous. New ideas and\r\nexperiences suggested by her children and grandchildren are met with resentment. They go against\r\nwhat she knows, what's comfortable. Change is forbidden. And as a sad result, mental and physical\r\ndeterioration accompany her refusal of change like red wine with steak. Slowly, she dies.\r\n\r\nAnd from the implications and examples of this insight, yet another is found: Change is easier\r\nthe earlier it's made. Having just begun her life, the infant is like a blank slate. Not yet molded\r\nby habits, she's receptive to change. To her, everything is new. No one path provides more\r\nfamiliarity and comfort than another. But as she grows older, as experiences are repeated and habits\r\nare formed, change becomes increasingly more difficult. God forbid that she too might one day grow\r\nold and herself become a close-minded widow. Repeating the same routine day in and day out.\r\nEngraving her stagnant beliefs into her mind, like text on a stone tablet.\r\nConstantly deferring change to \"tomorrow\". Not realizing that with each repetition her routine\r\nbecomes easier and change becomes harder. And after a lifetime of this deferral, change becomes\r\nimpossible. Any deviation from her familiar routine and beliefs causes pain, anxiety, and mental\r\nanguish.\r\n\r\nBut again it's not just the lifecycle of a human that this insight applies to. It's a universal\r\ntruth that exists across domains. It's easy to change the location of a house before construction\r\nhas begun. But once the foundation has been poured, things get much more difficult. The same is\r\ntrue of software. Changing the design of a software system during the design phase is frictionless,\r\nyou simply edit the text and diagrams that make up the current design. Once the system is in the\r\nimplementation phase, changes to the design become more tedious. They require communicating the\r\nchange to the developers building the system, re-writing code, re-writing the tests for that\r\ncode, and re-writing documentation. Changing the design of a system after it's in production\r\n(the final phase of the software development life-cycle) is the most difficult. In addition to all\r\nthe challenges from the previous two stages, you must also ensure the system continues to\r\nserve the needs of its (potentially million+) users. You have to continue\r\nfixing bugs in the original design while simultaneously implementing the new one. You have to\r\ncommunicate to project stakeholders why the design change is necessary, why it wasn't done this way\r\nin the first place, and why it's taking so long. The list of challenges goes on. And as the list\r\ngrows, the utility of the insight becomes more obvious. Change is easier the earlier it's made.\r\n\r\nAs I think about simple insights and their implications, more and more appear. Combining and\r\nfeeding off each other in a symbiosis of ideas. \"Do it right the first time\" pops into my mind as I\r\nconsider the tough implications of \"Change is easier the earlier it's made.\" And I'm sure that\r\nafter thinking through that insight another will follow. And I'll use that simple insight to\r\nexplain the \"why\" of something. Like why children are often joyful and why elders are often\r\nmiserable. Or I'll use it to help me make a decision. Like the decision to seek discomfort, or to\r\nembrace change, or to learn something new. And through making such decisions I might uncover yet\r\nanother simple insight that was hiding right under my nose the entire time.\r\n\r\nWhat simple insights are hiding in front of you?\r\n","title":"Simple Insights","description":"Identifying and utilizing simple ideas that hide in plain sight.","date":"2022-06-12","image":"https://raw.githubusercontent.com/Chris-Behan/chris-behan.github.io/master/public/images/money.jpg"}},"__N_SSG":true}