{"pageProps":{"postData":{"id":"killing-your-child-softly","content":"\r\nOne of the most detrimental forces to youth is the overly interventional parent. They watch over their children like a helicopter, analyzing their every move. If they foresee even the slightest chance of adversity in their Child's life, they attempt to swoop in and protect them. They're usually involved in every decision the child makes, every outcome they face, and how they evaluate that outcome. The sad result is a child robbed of his or her autonomy, unable to learn, unable to think, and unable to deal with the trials of life they’ll inevitably have to face. Paradoxically, the motivations of the helicopter parent are extremely selfish. They’ll jump through flaming hoops to protect their child under the guise of selflessness. But the truth is they are no Christ. They’re emotionally fragile beings, unwilling to subject themselves to the short-term distress of seeing their kid upset. They lack the courage required to let their child adventure through the real, dangerous world. They lack the foresight to see that their interventionalist parenting trades short-term safety for long-term disability. And the victims of their selfishness are the ones they try so desperately to protect.\r\n\r\nMy uncle James is sixty years old and on welfare. James grew up in Dublin, Ireland, where he was the oldest of his six siblings. Brenda, James’ single mother, was tough as nails, a trait required to raise six children on your own. But Brenda had a soft spot for her firstborn child. She made all of her children get jobs as soon as they could, except James. All of her children had a set of chores to do around the house, except James. All of her children were sent to public school, except James, who attended a boarding school Brenda could hardly afford. But today, decades later, James is the only one of his siblings on welfare. In fact, most of James’ siblings have gone on to do extraordinarily well in life, starting companies, becoming corporate executives, and so on.\r\n\r\nThroughout his life, James relied on Brenda for money. Money for rent, money for groceries, money for his children. And for most of his life, Brenda was happy to oblige. James was her favourite child after all, her golden boy. And what mother could stand to see their golden boy in distress. Unfortunately Brenda lacked the foresight to see the consequences of her actions. By constantly providing for James, she was depriving him of the opportunity to learn how to provide for himself. She was giving him fish but not teaching him how to fish. And now that Brenda is dead, James has to live with these consequences. He’s sixty years and on welfare. He can’t hold down a job, he has no savings of his own, and he relies on the quickly dwindling inheritance of his mother for pub money. There is no doubt that the emotional distress James would have endured as a child who had to get a job, do chores, and go to public school, would be infinitely less than the distress he faces now.\r\n","title":"Killing Your Child Softly","description":"The horrific consequences of the overly interventional parent.","date":"2022-02-17","image":"https://raw.githubusercontent.com/Chris-Behan/chris-behan.github.io/master/public/images/dublin.jpg"}},"__N_SSG":true}