{"pageProps":{"postData":{"id":"write-for-yourself","content":"A common misconception by people who don't write is that it's strictly for sharing knowledge you already have. This is the reason they don't write; they have nothing to share or believe they don't know the topic well enough to write about it. Writers don't hold this belief. Rarely do I write about a topic without coming out of it more enlightened.\n\nWriting is equally valuable for generating ideas and refining one's knowledge as it is for articulating them. Writing forces you to confront the uncomfortable reality that you don't really know what you're talking about. And for most people, this discomfort is enough to get them to put the pen down or close their laptop, and conclude that they \"don't know the topic well enough to write about it\". But for a writer, there is solace in this reality. There is an opportunity to learn, to flesh out one's thoughts, and to prove that they actually do know they're talking about.\n\nAn unfortunate paradox in life is that the more difficult something is, the greater the reward to be extracted from it. \"No pain no gain\" as your friend who frequents the gym might say. This makes sense when you really think about it, we've evolved to avoid suffering and conserve energy. Our biological feedback mechanisms are very poor at evaluating short-term vs. long-term rewards. So any task that involves suffering (mentally or physically) or a large expenditure of energy, is going to be less popular than an easy and pleasurable task. And if a task is less popular, there are going to be fewer people who are proficient at performing it, and thus it will be in higher demand. The higher the demand for something, the higher the price and consequently, the reward. \n\nOutcomes associated with an easy task are almost always less valuable than a more difficult one. Watching Netflix for example is a very easy and pleasurable task and its rewards reflect this. You gain immediate pleasure from the film in the form of laughter, surprise, suspense, or whichever other emotion it evoked. But the benefits from Netflix stop there. Books are a step up, both in difficulty and reward. They generally require more of your focus than a movie, and depending on the genre, are more likely to instill you with valuable knowledge, ideas, or perspectives that you can use in your own life. However, atop the cliff of intellectual difficulty and reward stands writing. Passive consumption is not an option with writing. Writing forces you to produce. It requires you to reflect, refine, and solidify your knowledge. In exchange for this labor, writing not only rewards you with a greater understanding than watching or reading but also a \"proof of thought\"; the writing itself, that you can share with others.\n\n![https://raw.githubusercontent.com/Chris-Behan/chris-behan.github.io/master/public/images/netflix_reading_writing.png](https://raw.githubusercontent.com/Chris-Behan/chris-behan.github.io/master/public/images/netflix_reading_writing.png)\n\nThe degree to which you retain and internalize knowledge is proportionate to the level of engagement you have with it. Writing forces maximal engagement. You can't be lazy when you write. You can't regurgitate what you've heard verbatim. You have to make sense of things. You have to find truth for yourself. I don't write to share what I already know with others. I write to strengthen my own understanding, generate new ideas, and learn. I write for myself.","title":"Write for yourself","description":"An explanation of why I write, and why you should to.","date":"2021-05-22"}},"__N_SSG":true}