{"pageProps":{"postData":{"id":"difficulty-points","content":"Times are changing. Everyone and their dog now has access to generative AI models that can produce incredible art and pretty good literature in a matter of seconds. We’re experiencing the TikTokification of intellectual work in real time. And the result will be a convergence of content towards a melting pot of similarity. \r\nGenerative models vastly reduce the number of inputs that go into the creative process.\r\nInstead of having to think about each sentence and how it contributes to the idea of the paragraph, or how that paragraph flows into the next,\r\nyou simply ask the model to write you an article on why X is better than Y.\r\nThe model then searches a giant set of data, looking for information on X and Y, along with examples of writing that compares 2 things, then it outputs the result.\r\nDone.\r\nThe problem is, when you had to write each sentence yourself, the likelihood of you writing the same thing as someone else was very small.\r\nBut when all you need to do is write a prompt explaining what you want to write, the likelihood of that prompt being the same as someone else's goes way up.\r\nAnd since you're all using the same model, trained on the same set of data, the results will be almost identical.\r\nPut a hundred writers in a room and tell them to write an article on why Democracy is better than dictatorship and you'll get 100 very different papers.\r\nBut if you put the same 100 writers in the room and tell them to use [ChatGPT](https://openai.com/blog/chatgpt/) to write an article on why Democracy is better than dictatorship, you might just get the same paper 100 times.\r\n\r\n\"There are no points for difficulty\" is a piece of advice that recommends sticking to your strengths and avoiding your weaknesses.\r\nIt promotes taking the easier, more efficient path, whenever possible and views difficulty as inherently bad.\r\nIt's the line of thinking that high schoolers use to rationalize writing their essays with ChatGPT.\r\nIt's a piece of advice would recommend using [DALLE-2](https://openai.com/dall-e-2/) instead of a paintbrush and canvas.\r\nThere are no points for difficulty if you believe all that matters is the outcome and not your ability to produce that outcome.\r\nIt's the results-obsessed reasoning that's so prevalent in media, social and otherwise, that gives disproportionate attention to a model's 6-pack or a CEO's multi-billion dollar exit while skipping over the process that led to those results.\r\nBut there are points for difficulty.\r\n\r\nDifficulty is the grindstone of human ability.\r\nEvery time you overcome a difficult challenge you increase your ability to overcome even more difficult challenges in the future.\r\nYou're like a video game character that levels up from difficulty points.\r\nAnd one of the greatest difficulties you face is the temptation to avoid difficulty.\r\nA temptation that's becoming easier than ever to fulfill with the emergence of technologies that do the work for you.\r\n\r\nRight now, it's especially important to neglect the idea that \"there are no points for difficulty\".\r\nTo avoid being the founder that creates one of 10,000 non-differentiable ChatGPT startups. \r\nTo avoid being the artist that abandons their pursuit of drawing to become a “Prompter” for DALL-E 2. \r\nTo avoid being the writer that off-loads their ability to write, and thus think, to ChatGPT. \r\nIn a time where it’s never been easier to avoid difficulty, the differentiator will be your ability to embrace it.","title":"Difficulty Points","description":"Why you shouldn't get ChatGPT to do your homework.","date":"2022-12-11","image":"https://raw.githubusercontent.com/Chris-Behan/chris-behan.github.io/master/public/images/lensa.jpeg"}},"__N_SSG":true}