{"pageProps":{"postData":{"id":"the-utility-of-the-devil","content":"\r\nI'm not religious but I believe wholeheartedly in the Devil. Not the horned figure with the hooves\r\nof a goat. I'm talking about what the Devil represents: temptation, instant gratification, and\r\ncomfort. The Devil is whispering to me right now as I write. \"Go lay down on the couch and relax,\r\nyou can write later.\" he says in his seductive voice. But today his evil whispers have the opposite\r\neffect. They motivate me. They tell me exactly what I ought to be doing.\r\n\r\nWhether or not you actually believe the Devil is the voice in your head telling you to procrastinate\r\nor splurge on some cheap dopamine, the utility remains. The voice is a compass that can guide you\r\ntowards fulfillment. Avoid its advice like the plague. And charge toward what it discourages.\r\nDon't try and understand its reasoning. The Devil is a fucking liar. He'll pull out every trick\r\nin the book to keep you from taking action. He'll tirelessly tempt you with short-term rewards\r\nthat have catastrophic long-term consequences. Tales of your motivated future self and underselling\r\nthe harm of instant gratification are two of his favorite techniques.\r\n\r\nLucky for us, it's easy to identify when the Devil speaks. He always encourages immediate comfort\r\nand satisfaction while disregarding the future. If wisdom is knowing the long-term consequences of\r\nyour actions, then the Devil wants you to be an idiot. He's the one telling you to have one more\r\ndrink. He's the one convincing you to stay in that relationship that you know won't last. He's the\r\none telling you that you'll certainly fail if you pursue your dreams.\r\n\r\nIt's the Devil's voice that's responsible for unreached potential. Obesity, addiction, and toxic\r\nrelationships are all his bidding. And although his temptation never stops, we're at least able to\r\nidentify it. There's great utility in viewing your inner voice of weakness as an evil adversary\r\nwhose goal is to stop you from reaching your potential. Whether or not it's true is beside the\r\npoint. You can extract real energy and motivation from imagining so. Energy and motivation that\r\ncan be used to make real decisions with long-term benefits.\r\n","title":"The Utility of the Devil","description":"Extracting energy from your inner voice of weakness.","date":"2022-05-29","image":"https://raw.githubusercontent.com/Chris-Behan/chris-behan.github.io/master/public/images/2-paths.jpg"}},"__N_SSG":true}