{"pageProps":{"postData":{"id":"use-it-or-lose-it","content":"\r\nMy first time picking up a basketball this summer was infuriating. My shot was way off, my handles were sloppy, and my left hand had disappeared. A Canadian winter combined with a global pandemic forced me to go 8 months without playing ball. And boy did my basketball game feel that layoff. My deteriorated basketball skills reminded me of one of life's most unfortunate realities, you either use it, or you lose it.\r\n\r\nBoth physical and mental abilities suffer from deterioration over time. Stop going to the gym for a year and your gains will evaporate. Stop reading for a year and your speed and comprehension revert to grade-school levels. As Brazilian jui-jitsu mastermind [John Danaher](<https://en.wikipedia.org/wiki/John_Danaher_(martial_artist)>) says, \"Skills are perishable\". This is a fucking tragedy.\r\n\r\nIt's a tragedy because it contradicts our innate desire for a destination. There is no level of competence that is immune to deterioration. You can set yourself any arbitrary goal: run a marathon, get a promotion, build a strong relationship, but the destination is temporary. The second you stop training, working, and building, the trajectory trends downwards. Stagnation is not the default state, decline is. I ran a [half marathon in February](https://twitter.com/behan_chris/status/1355381404146704386) and haven't run since. I decided to go for a run the other day (4 months later) and coughed up a lung around the 6km mark. I'm confident I'll be back to my old self in no time, but the fact remains that abilities decline, and they decline quicker than you'd think.\r\n\r\nThe fact that skills are perishable and the reality that time is limited means you can't be good at everything. By choosing to invest time into something, you are also choosing **not** to spend time on something else. The decision to play video games is also a decision not to read. Choosing to hang out with your friends is also a choice to not spend time with your family. And the second you stop working on something, deterioration begins. The amount of time we spend on the decision-making process for how we choose to spend time itself is a sacrifice. Spend too much time contemplating the perfect way to spend your time and you'll never get anything done. But spend too little time and you may find yourself in a dead-end job or a toxic relationship. What we can achieve in life is limited by how much time we have and how we choose to focus our efforts.\r\n\r\nBut this limit need not cause angst. Instead, it should breed excitement. There exists a unique set of skills and relationships that only you are willing to cultivate. Whatever your niche is, multiply it by the scale factor of the internet and you may soon find yourself with an audience in the 10's of thousands. Nick Huber ([@sweatystartup](https://twitter.com/sweatystartup)) tweets about his experience managing storage facilities and has built up an audience of over 129k followers on Twitter. Josh Rogin posts pictures of [watches and ramen](https://www.instagram.com/watchtheramen) on Instagram and has accumulated over 5k followers. The more unique and specialized your skillset, the less competition you'll have. As [Naval Ravikant](https://twitter.com/naval) says “Escape competition through authenticity\".\r\n\r\nNext time you find yourself saying something along the lines of \"I'm only doing X so that I can get Y\", ask yourself 2 questions.\r\n\r\n1. Is X something I want to do in the long term?\r\n2. Do I really care about Y?\r\n\r\nIf you're only doing X to reach some arbitrary destination, remember that skills are perishable. The second you stop working on X, your competence in it will begin to deteriorate. In addition, by choosing to spend your time on X, you are also neglecting to spend time on what you actually enjoy doing. So why on earth would you do this to reach a Y that you don't actually care about? If you don't have a really good answer to this question, it's time to make a change.\r\n","title":"Use it or lose it","description":"My thoughts on one life's greatest tragedies and the opportunity it presents.","date":"2021-06-21"}},"__N_SSG":true}