{"pageProps":{"postData":{"id":"how_not_to_change_someones_mind","content":"\r\nYour neighbour Walter is a fool. He supports that evil political party and follows that backwards\r\nreligion. It's shocking to you how someone who lives right next door, who sends their kids to the\r\nsame school as yours, and who also enjoys smoking brisket on their porch, could hold such\r\nunacceptable views. Here's how _not_ to change Walter's mind, how to make him double down on his\r\nbeliefs, and how to make him resent your own.\r\n\r\n## 1. Tell, don't ask\r\n\r\nInstead of asking Walter why he believes what he does, tell him\r\nthat he's wrong and that your beliefs are obviously right. By not listening to the experiences\r\nthat led to Walter's beliefs, you eliminate the possibility of understanding why he thinks the\r\nway he does. And by not understanding the 'why' behind Walter's perspective, you remove the risk\r\nof agreeing with his thought process and possibly changing your own. Additionally, Walter will\r\ninterpret your unwillingness to listen as arrogance. He'll associate your _obviously right_\r\nbeliefs and values with those of closed-minded assholes. From his experience, people who\r\nhold these beliefs and values (you), are unwilling to listen, and disregard alternative viewpoints\r\nas foolish. When criticizing Walter's beliefs, be sure to raise your voice and use the word \"You\"\r\nas much as possible. By blurring the line between Walter and his beliefs, he'll interpret your\r\nattack on his ideology as an attack on him. And our natural reaction when we're attacked is to\r\ndefend. Walter will reflexively defend himself and his beliefs, which you treat as one and the same,\r\nwhile simultaneously developing resentment towards your beliefs (the beliefs of his attacker).\r\nOnce someone's entered a defensive mindset, they're no longer receptive to new ideas.\r\nTheir sole focus is on winning the encounter, which in the context of intellectual debate means being\r\n\"right\", as opposed to finding the truth.\r\n\r\n## 2. Combine the Minority with the Majority\r\n\r\nFind cases of exceptionally stupid people who share Walter's beliefs, then falsely infer that\r\neveryone who shares his beliefs is stupid. Every ideological group has radicals. Seek out the most\r\nsensational examples from this minority of radicals and apply their negative attributes to the majority.\r\nFor example, if belief A has a small group of violent followers, condemn belief A in\r\nits entirety by claiming _all_ its followers are violent. This strategy works for any and all beliefs,\r\nfrom religion to technology. Your dishonest argument which was made solely to discredit Walter's beliefs\r\nwill signal to him that you have no true intention of understanding. And having just compared Walter\r\nto stupid radicals, he'll never share his true thoughts with you again, for fear of being compared to\r\nstupid radicals.\r\n\r\n## 3. Use Labels\r\n\r\nTo avoid productive discourse, slap negative labels on the most prominent members of Walter's\r\nideology so that you can discredit their perspective without having to contend with their arguments.\r\nThis will save you immense time and energy while ensuring your own perspective remains static.\r\n\r\nExample:\r\n\r\n```\r\nWalter: \"<Prominent member of ideology> talks about how <rationale for belief>, which really resonates with me.\"\r\nYou: \"<Prominent member of ideology> is a <negative label>!\".\r\n```\r\n\r\n9/10 times the conversation ends once the label has been applied. If Walter tries to continue the conversation\r\nafter the application of the label, ask him if he supports `<negative label>`, and subtly infer that\r\nby continuing the conversation he himself is a `<negative label>`.\r\nThe use of labels allows you to sneakily throw out the intellectual baby with Walter's ideological\r\nbathwater.\r\n\r\n## 4. Use Strawman Arguments\r\n\r\nA \"Strawman\" argument is when you take someone's argument, distort it into a weaker argument, then\r\nattack that weaker argument. By distorting their argument into one that is obviously wrong, you\r\nstand up the metaphorical \"Strawman\", allowing you to easily assault the defenseless Scarecrow.\r\nCommon distortions include removing context, oversimplifying, exaggerating, or misrepresenting\r\nthe argument entirely.\r\n\r\nExample:\r\n\r\n```\r\nWalter: \"Intermittent fasting is good for you\"\r\nYou: \"But if you starve yourself you'll have no energy\".\r\n```\r\n\r\nYou've distorted Walter's argument by\r\nreplacing \"Intermittent fasting\" with \"Starvation\" which is obviously harmful and easy to attack.\r\nIf Walter doesn't notice your manipulation of words, he'll hopelessly try and defend the argument\r\n\"Starvation is good for you\".\r\n","title":"How Not To Change Someones Mind","description":"Four simple tactics to ensure someone doesn't change their mind.","date":"2022-04-11","image":"https://raw.githubusercontent.com/Chris-Behan/chris-behan.github.io/master/public/images/cactus.jpg"}},"__N_SSG":true}