{"pageProps":{"postData":{"id":"abolishing-goals","content":"\r\nIt’s the evening of January 29, 2021. I’ve just ran 22km along the Vancouver coastline. I’d set myself the goal of running a half-marathon three months prior. And here I am, standing alone in the rain, high on the endorphins that accompany a long run. Conqueror of my goal. On the walk home my adrenaline wears off and I begin to feel nauseous. I open the door, take off my clothes and head straight for the shower. My nipples are bleeding profusely and my feet look like they’ve been through a cheese grater. An unfortunate consequence of running 22k in a cotton shirt and running shoes that are a size too small. I didn’t run again for almost a year. Not because I was deterred by chaffed nipples or bloody feet. But because I’d achieved my goal.\r\n\r\nGoals are all about outcomes. Get the job, the promotion, the six-pack, the fancy car, you name it. And once you’ve achieved the goal, you abandon the endeavor associated with it or you replace it with a loftier one. The first path sucks. Sure you get to say “I ran a half marathon” or “I got promoted at such and such a company” but if upon achievement of the goal, you abandon the activity associated with it, you’ll slowly degrade back to your initial state. Don’t run for a year and your cardio reverts back to where it was before you started. Stagnation is not the default state, decline is. The second path also sucks if you don’t have a genuine interest in the endeavor associated with your goal. You’ll find yourself in a constant pursuit of fleeting gratification. The goals are the means to the end and you justify to yourself that “after I get X I’ll be happy” or “after I achieve Y I’ll be at peace”. But of course, if you can’t extract peace or happiness from the process itself, they'll continue to elude you no matter how many goals you accomplish.\r\n\r\nThe one path where goals are worthwhile is when they’re treated strictly as a feedback mechanism for gauging your performance and adapting your behavior. Success in achieving your goal is a signal that what you’re doing works. Failure to achieve your goal may indicate you need to change your process. But even as a feedback mechanism their utility is limited. Goals that are competitive in nature depend on someone or something outside of your control. Getting the job depends on the hiring committee, getting the promotion depends on your manager, winning the marathon depends on your genetics. Every goal that involves others has some factor that is beyond your influence. Even if you play a perfect hand, it won’t always be enough. I’m not saying you shouldn’t have goals because they’re not all guaranteed. Nothing’s guaranteed. But I am saying there’s a way to escape the game of probabilities and transcend goals.\r\n\r\nIn the last year I’ve abolished all my personal goals. I’ve shifted my mindset from the destination to the trajectory. I’ve spent minimal time thinking about where I want to be and maximal time being. Instead of obsessing over how many people read my writing, I just write. Instead of talking about how far I’m going to run, I just run. And inadvertently this shift has resulted in the achievement of goals I wasn’t able to achieve when all I cared about were the goals.\r\n","title":"Abolishing Goals","description":"Achieving my goals by abandoning them.","date":"2022-01-27","image":"https://raw.githubusercontent.com/Chris-Behan/chris-behan.github.io/master/public/images/stanley_park.jpg"}},"__N_SSG":true}